/**
 * Необходимо реализовать логику автомата по продаже плюшек. Автомат должен иметь возможность принимать платежи и выдавать сдачу.
 * В автомате должен быть набор монет номиналом 10 5 2 и 1 рубль. Количество монет ограничено. Должна быть возможность добавления монет в автомат.
 * Автомат должен работать таким образом, чтобы у него как можно дольше сохранялась возможность выдавать сдачу.
 * Например если он за раз выдаст всё рублями, то скорее всего со следующей покупки если понадобится рубль, сдать сдачу уже не сможет.
 *
 * @author Mikhail Kubar
 * @version 1.0
 * @since 30.09.17
 */
package ru.job4j.vendingMashine;
