package ru.job4j.bomberman.second;

/*
Второй этап.

1. Есть игровое поле - двухмерный массив. Есть герои - Бомбермен и чудовища.
2. Приложение не должно блокировать все игровое поле.
3. В поле должны существовать блоки. поля куда нельзя ходить.
4. Бомбермен должен управляться через пользователя. (Пользовательский ввод реализовывать не надо) только апи, для движения.
5. Чудовища должны двигаться автоматически.
6. Предусмотреть, что если чудовище не может двинуться на клетку. например, там стоит другое чудовище, проверять в течении .5 секунд и двигаться в другую строну.
7. Сложность поля и количество чудовищ должно варьироваться.
 */