/**
 * Общая задача на второй модуль. [#4032]
 * 1. Необходимо создать программу учета заявок;
 * 2. Работать приложение должно в консоли;
 * 3. Клиент запускают программу java –jar tracker.jar;
 * 4. В консоли отображается приветствие и описание программы. После этого пользователю отображается консольное меню. Список всех действий, которые поддерживаются в системе. Пользователю предлагается выбирать действие, которое он хочет совершить. Когда действие закончено. Пользователю опять отображается меню. В меню должен быть пункт выйти.
 * 5. В заявке должна быть следующая информация: Имя, Описание, Дата создания, Cписок комментариев.
 *
 * Приложение должно осуществлять следующие действия:
 *
 * 1. Добавление новой заявки;
 * 2. Редактирование заявки;
 * 3. Удаление заявки;
 * 4. Отображение списка всех заявок;
 * 5. Отображения заявок с условием фильтра;
 * 6. Добавлять к заявке комментарии.
 *
 * @author Mikhail Kubar
 * @version 1.0
 * @since 09.09.17
 */
package ru.job4j.tracker;
